
//   <!--  |---------------------------|
//         | SwiftMan by ARMAN RAHMAN  |
//         |---------------------------| -->

let data = [
    [
        ['সোমবার'],
        ['মঙ্গলবার'],
        ['বুধবার'],
        ['বৃহস্পতিবার'],
        ['শুক্রবার'],
        ['শনিবার'],
        ['রবিবার'],
    ],
    [
        ['vat','মুরগী ভুনা', 'ভাজি/সবজি', 'ডাল'],
        ['ভাত','ডিম ভুনা', 'শাক/সবজি', 'ডাল'],
        ['ভাত','মাছ', 'ভর্তা', 'ডাল'],
        ['ভাত','ডিম ভুনা', 'মুগডাল/বুটেরডাল'],
        ['সাদা পোলাও','গরুর গোস্তভুনা', 'সালাদ/সবজি'],
        ['ভাত','পাঙ্গাস মাছ', 'ভাজি/ডিম', 'ডাল'],
        ['ভাত', 'সবজি দিয়ে ছোট মাছ', 'ভর্তা', 'ডাল'],
    ],
    [
        ['ভাত','মুরগী ভুনা', 'ভাজি/সবজি', 'ডাল'],
        ['ভাত','ডিম ভুনা', 'শাক/সবজি', 'ডাল'],
        ['ভাত','মাছ', 'ভর্তা', 'ডাল'],
        ['ভাত','ডিম ভুনা', 'মুগডাল/বুটেরডাল'],
        ['সাদা পোলাও','গরুর গোস্তভুনা', 'সালাদ/সবজি'],
        ['ভাত','পাঙ্গাস মাছ', 'ভাজি/ডিম', 'ডাল'],
        ['ভাত', 'সবজি দিয়ে ছোট মাছ', 'ভর্তা', 'ডাল'],
    ],
    [
        ['ভাত','মুরগী ভুনা', 'ভাজি/সবজি', 'ডাল'],
        ['ভাত','ডিম ভুনা', 'শাক/সবজি', 'ডাল'],
        ['ভাত','মাছ', 'ভর্তা', 'ডাল'],
        ['ভাত','ডিম ভুনা', 'মুগডাল/বুটেরডাল'],
        ['সাদা পোলাও','গরুর গোস্তভুনা', 'সালাদ/সবজি'],
        ['ভাত','পাঙ্গাস মাছ', 'ভাজি/ডিম', 'ডাল'],
        ['ভাত', 'সবজি দিয়ে ছোট মাছ', 'ভর্তা', 'ডাল'],
    ],
    [
        ['ভাত','মুরগী ভুনা', 'ভাজি/সবজি', 'ডাল'],
        ['ভাত','ডিম ভুনা', 'শাক/সবজি', 'ডাল'],
        ['ভাত','মাছ', 'ভর্তা', 'ডাল'],
        ['ভাত','ডিম ভুনা', 'মুগডাল/বুটেরডাল'],
        ['সাদা পোলাও','গরুর গোস্তভুনা', 'সালাদ/সবজি'],
        ['ভাত','পাঙ্গাস মাছ', 'ভাজি/ডিম', 'ডাল'],
        ['ভাত', 'সবজি দিয়ে ছোট মাছ', 'ভর্তা', 'ডাল'],
    ],
];

// Full Menu Start
function weekData(week){
    let items = "";
    for(let i = 0; i < data[0].length; i++){
        items += `<tr><td>${data[0][i]}</td><td>${data[week][i]}</td></tr>`;
    }

    return items;
}

let fullTable = "";

console.log(data.keys());

for(let j = 1; j < data.length; j++){
    if(j == 1){
        var weekName = "1st";
    }else if(j == 2){
        var weekName = "2nd";
    }else if(j == 3){
        var weekName = "3rd";
    }else{
        var weekName = "4th";
    }

    fullTable += `
    <div class="d-flex justify-content-center">
        <div class="week"> ${weekName} Week</div>
    </div>
    <div class="d-flex justify-content-center">
        <table class="table table-hover menu-table">
            <thead>
                <tr class="table-header">
                        <th scope="col">Day</th>
                        <th scope="col">Menu</th>
                </tr>
            </thead>
            <tbody>
            ${weekData(j)}
            </tbody>
        </table>
    </div> 
    `;
}

document.querySelector("#tableData").innerHTML = fullTable;

// Full Menu End

// Today's Menu Start
    
// Today's Menu End
